# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.observability.data.azurerm_client_config.current: Reading...
module.observability.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.infra-resources.azapi_resource.eso will be created
  + resource "azapi_resource" "eso" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + external-secrets-operator = {
                      + force                  = false
                      + path                   = "./"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/external-secrets-operator"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "external-secrets-operator"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/auth-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/auth-at22-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.otel_collector will be updated in-place
  ~ resource "azapi_resource" "otel_collector" {
      ~ body                      = {
          ~ properties = {
              ~ kustomizations             = {
                  ~ otel-collector = {
                      + postBuild              = {
                          + substitute = {
                              + CLIENT_ID = "04cd7b98-cfc6-4455-b01f-7123b28da20c"
                              + KV_URI    = (known after apply)
                              + TENANT_ID = (sensitive value)
                            }
                        }
                        # (7 unchanged attributes hidden)
                    }
                }
                # (5 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/auth-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/auth-at22-aks/providers/Microsoft.KubernetesConfiguration/fluxConfigurations/otel-collector"
      + location                  = (known after apply)
        name                      = "otel-collector"
      ~ output                    = {
          - id         = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/auth-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/auth-at22-aks/providers/Microsoft.KubernetesConfiguration/fluxConfigurations/otel-collector"
          - properties = {
              - complianceState      = "Compliant"
              - errorMessage         = ""
              - kustomizations       = {
                  - otel-collector = {
                      - name = "otel-collector"
                    }
                }
              - provisioningState    = "Succeeded"
              - repositoryPublicKey  = ""
              - sourceSyncedCommitId = "at_ring2@sha256:589d6bec2944450e4b7879a67186c8ae2bffb77a34412f6fdc6278b31b0d2090"
              - sourceUpdatedAt      = "2025-05-16T12:27:25+00:00"
              - statusUpdatedAt      = "2025-05-16T14:21:00.649+00:00"
              - statuses             = [
                  - {
                      - statusConditions = [
                          - {},
                          - {},
                        ]
                    },
                  - {
                      - statusConditions = [
                          - {},
                          - {},
                        ]
                    },
                ]
            }
          - type       = "Microsoft.KubernetesConfiguration/fluxConfigurations"
        } -> (known after apply)
      + tags                      = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.observability.azurerm_key_vault.obs_kv must be replaced
-/+ resource "azurerm_key_vault" "obs_kv" {
      ~ access_policy                   = [] -> (known after apply)
      - enable_rbac_authorization       = false -> null
      - enabled_for_deployment          = false -> null
      - enabled_for_disk_encryption     = false -> null
      - enabled_for_template_deployment = false -> null
      ~ id                              = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/auth-at22-obs-rg/providers/Microsoft.KeyVault/vaults/obs-auth-at22-kv" -> (known after apply)
      ~ name                            = "obs-auth-at22-kv" -> (known after apply) # forces replacement
      - purge_protection_enabled        = false -> null
      - tags                            = {} -> null
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ tenant_id                       = (sensitive value)
      ~ vault_uri                       = "https://obs-auth-at22-kv.vault.azure.net/" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ contact (known after apply)

      ~ network_acls (known after apply)
      - network_acls {
          - bypass                     = "AzureServices" -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }
    }

  # module.observability.azurerm_key_vault_secret.conn_string will be created
  + resource "azurerm_key_vault_secret" "conn_string" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "connectionString"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.observability.azurerm_role_assignment.obs_kv_reader will be created
  + resource "azurerm_role_assignment" "obs_kv_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32c445b8-8af3-4f40-afd6-22dc6e8386cc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.observability.random_string.obs_kv_postfix will be created
  + resource "random_string" "obs_kv_postfix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 5 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `pull_request` |
| Working Directory | `./infrastructure/altinn-auth-test/auth-at22-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/auth-at22-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_auth-at22-aks-rg.tfstate.tfplan`